import openpyxl
from openpyxl.styles import Font
from openpyxl.utils import get_column_letter
data = [
    {"Таб. номер": "0002", "Фамилия": "Петров П.П.", "Отдел": "Бухгалтерия", "Сумма по окладу, руб.": 3913.04,
     "Сумма по надбавкам, руб.": 2608.7, "НДФЛ, %": 13},
    {"Таб. номер": "0005", "Фамилия": "Васин В.В.", "Отдел": "Бухгалтерия", "Сумма по окладу, руб.": 5934.78,
     "Сумма по надбавкам, руб.": 913.04, "НДФЛ, %": 13},
    {"Итог": "Бухгалтерия"},
    {"Таб. номер": "0003", "Фамилия": "Иванов И.И.", "Отдел": "Отдел кадров", "Сумма по окладу, руб.": 6000.00,
     "Сумма по надбавкам, руб.": 4000.00, "НДФЛ, %": 13},
    {"Таб. номер": "0006", "Фамилия": "Сидоров С.С.", "Отдел": "Отдел кадров", "Сумма по окладу, руб.": 5000.00,
     "Сумма по надбавкам, руб.": 4500.00, "НДФЛ, %": 13},
    {"Таб. номер": "0008", "Фамилия": "Петров Л.И.", "Отдел": "Отдел кадров", "Сумма по окладу, руб.": 4074.07,
     "Сумма по надбавкам, руб.": 2444.44, "НДФЛ, %": 13},
    {"Таб. номер": "0007", "Фамилия": "Волков В.В.", "Отдел": "Отдел кадров", "Сумма по окладу, руб.": 1434.78,
     "Сумма по надбавкам, руб.": 1434.78, "НДФЛ, %": 13},
    {"Итог": "Отдел кадров"},
    {"Таб. номер": "0004", "Фамилия": "Мишин М.М.", "Отдел": "Столовая", "Сумма по окладу, руб.": 5500.00,
     "Сумма по надбавкам, руб.": 3500.00, "Сумма зарплаты, руб.": 7800000, "НДФЛ, %": 13},
    {"Итог": "Столовая"},
    {"Общий итог": "Общий итог"}
]
wb = openpyxl.Workbook()
sheet = wb.active
headers = ["Таб. номер", "Фамилия", "Отдел", "Сумма по окладу, руб.", "Сумма по надбавкам, руб.",
           "Сумма зарплаты, руб.", "НДФЛ, %", "Сумма НДФЛ, руб.", "Сумма к выдаче, руб."]
sheet.append(headers)

section_stats = {
    "Сумма по окладу, руб.": 0,
    "Сумма по надбавкам, руб.": 0,
    "Сумма зарплаты, руб.": 0,
    "Сумма НДФЛ, руб.": 0,
    "Сумма к выдаче, руб.": 0
}

final_stats = {
    "Сумма по окладу, руб.": 0,
    "Сумма по надбавкам, руб.": 0,
    "Сумма зарплаты, руб.": 0,
    "Сумма НДФЛ, руб.": 0,
    "Сумма к выдаче, руб.": 0
}


def calculate_and_add_row(row):
    salary = row["Сумма по окладу, руб."] + row["Сумма по надбавкам, руб."]
    tax = round(salary * row["НДФЛ, %"] / 100, 2)
    net_salary = salary - tax
    sheet.append(
        [row["Таб. номер"], row["Фамилия"], row["Отдел"], row["Сумма по окладу, руб."], row["Сумма по надбавкам, руб."],
         salary, row["НДФЛ, %"], tax, net_salary])

    section_stats["Сумма по окладу, руб."] += row["Сумма по окладу, руб."]
    section_stats["Сумма по надбавкам, руб."] += row["Сумма по надбавкам, руб."]
    section_stats["Сумма зарплаты, руб."] += salary
    section_stats["Сумма НДФЛ, руб."] += tax
    section_stats["Сумма к выдаче, руб."] += net_salary

for record in data:
    if "Таб. номер" in record:
        calculate_and_add_row(record)
    elif "Итог" in record:
        sheet.append([
            "", "", f"{record['Итог']} \nИтог",
            section_stats["Сумма по окладу, руб."],
            section_stats["Сумма по надбавкам, руб."],
            section_stats["Сумма зарплаты, руб."], "",
            section_stats["Сумма НДФЛ, руб."],
            section_stats["Сумма к выдаче, руб."]
        ])
        final_stats = {key: final_stats[key] + section_stats[key] for key in section_stats}
        section_stats = {key: 0 for key in section_stats}
    elif "Общий итог" in record:
        sheet.append([
            "", "", record["Общий итог"],
            final_stats["Сумма по окладу, руб."],
            final_stats["Сумма по надбавкам, руб."],
            final_stats["Сумма НДФЛ, руб."],
            final_stats["Сумма зарплаты, руб."], "",
            final_stats["Сумма к выдаче, руб."]
        ])

for cell in ['C4', 'C9', 'C11', 'C12']:
    sheet[cell].font = Font(bold=True)

wb.save("table.xlsx")